## 01 Importing Libraries and csv files

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [2]:
# Define path

path = r'/Users/andymiller/Desktop/CareerFoundry Data Analytics/4. Python/Aug 2025 Instacart Basket Analysis'

In [3]:
# Import products.csv

df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [4]:
# Import orders_wrangled.csv

df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

## 02 Bug Hunting

In [5]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [6]:
# Create a dataframe

df_test = pd.DataFrame()

In [7]:
# Create a mixed type column

df_test['mix'] = ['a', 'b', 1 , True]

In [8]:
df_test

    mix
0     a
1     b
2     1
3  True

In [9]:
df_test.describe()

        mix
count     4
unique    3
top       1
freq      2

In [10]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mix     4 non-null      object
dtypes: object(1)
memory usage: 164.0+ bytes

In [11]:
# Check for mixed types

for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [12]:
#  Set columns with mixed datatypes to be strings

df_test['mix'] = df_test['mix'].astype('str')

In [13]:
# Check again for mixed types, add in an else to confirm that there are none

for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
      print (col)
  else:
      print ("no")

no

In [44]:
# Look for missing data in products dataframe

df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [15]:
# Filter rows with missing product names

df_nan = df_prods[df_prods['product_name'].isnull() == True]
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [18]:
# Find out how many rows there are in the products dataframe

df_prods.shape

(49693, 5)

In [17]:
# Create a new dataframe with out the rows that have missing product names

df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [19]:
#  Confirm that there are now 16 less rows than before

df_prods_clean.shape

(49677, 5)

In [20]:
#  Check for duplicate rows in the products dataframe

df_dups = df_prods_clean[df_prods_clean.duplicated()]
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [21]:
# Verify that there are in fact duplicates of these rows

df_prods_clean[df_prods_clean['product_name'] == "Ranger IPA"]

       product_id product_name  aisle_id  department_id  prices
18458       18458   Ranger IPA        27              5     9.2
18459       18458   Ranger IPA        27              5     9.2

In [67]:
df_prods_clean.shape

(49677, 5)

In [22]:
# Drop the duplicate rows

df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [23]:
# Check that there are now 5 less rows than before

df_prods_clean_no_dups.shape

(49672, 5)

In [24]:
# Check that the duplicate rows are no longer present 

df_prods_clean_no_dups[df_prods_clean_no_dups['product_name'] == "Ranger IPA"]

       product_id product_name  aisle_id  department_id  prices
18458       18458   Ranger IPA        27              5     9.2

In [25]:
#  Export the data as products_checked.csv

df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

# Task 4.5 - Consistency Checks (v2)

### Perform consistency checks on the df_ords dataframe

In [26]:
# importing libraries and csv file
import pandas as pd
import numpy as mp
import os

In [27]:
# Define path

path = r'/Users/andymiller/Desktop/CareerFoundry Data Analytics/4. Python/Aug 2025 Instacart Basket Analysis'

# Import order_wrangled.csv

df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [10]:
# 2. Looking at the df_ords descriptive statistics to identify issues.
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [9]:
df_ords

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...,...
3421078,3421078,2266710,206209,10,5,18,29.0
3421079,3421079,1854736,206209,11,4,10,30.0
3421080,3421080,626363,206209,12,1,12,18.0
3421081,3421081,2977660,206209,13,1,12,7.0
3421082,3421082,272231,206209,14,6,14,30.0

### 3. Checking for mixed-type data in df_ords

In [32]:
# Check for mixed-type data in df_ords

for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)
else: 
    print ("none")

none

### 4. Fix columns in df_ords

In [33]:
# There were no columns in df_ords with mixed type data that needed to be fixed.

### 5. Checking for missing values in df_ords

In [37]:
# Check for missing values in df_ords

df_ords.columns[df_ords.isnull().any()]

Index(['days_since_prior_order'], dtype='object')

In [38]:
# Create dataframe containing the rows with days_since_prior_order missing
df_nan_ords = df_ords[df_ords['days_since_prior_order'].isnull() == True]
df_nan_ords

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

In [31]:
# See how many rows there are in df_ords

df_ords.shape

(3421083, 7)

In [30]:
# See how many rows there are with missing values

df_nan_ords.shape

(206209, 7)

The missing values are in the days_since_prior_order column.  This isn't necessarily a problem.  It likely occurs when the customer places their first order.  In this case it would make sense to replace the NaN values in this column with the value 0.

### 6. Dealing with Nan values in the 'days_since_prior_order' column

In [35]:
#  Imputing 0 is chosen because this makes sense since the order is a first order by a customer.

In [39]:
df_ords_clean = df_ords.copy()
df_ords_clean['days_since_prior_order'] = df_ords_clean['days_since_prior_order'].fillna(0)

### 7. Check for duplicate values in df_ords

In [40]:
# Check for duplicate values
df_ords_dups = df_ords_clean[df_ords_clean.duplicated()]
df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

In [23]:
#  There are no duplicate values in df_ords_clean

In [41]:
df_ords_clean

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,0.0
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...,...
3421078,3421078,2266710,206209,10,5,18,29.0
3421079,3421079,1854736,206209,11,4,10,30.0
3421080,3421080,626363,206209,12,1,12,18.0
3421081,3421081,2977660,206209,13,1,12,7.0
3421082,3421082,272231,206209,14,6,14,30.0

###  8.  Dealing with duplicate values in df_ords

In [42]:
# Since there were no duplicates, either there is nothing to do in step 8 or I have got something wrong previously.

###  9. Exporting the df_ords_clean_dups dataframe

In [43]:
# Export df_ords_clean to the Prepared Data folder

df_ords_clean.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked2.csv'))